Positronico/claudeq/firmware/companion/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_WIFI_GMAC_SUPPORT=n
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_HOOK_IP6_INPUT_NONE=y
CONFIG_MBEDTLS_GCM_SUPPORT_NON_AES_CIPHER=n
CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_IMG_CACHE_DEF_SIZE=2
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_LV_USE_DEMO_MUSIC=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=4096
CONFIG_HTTPD_MAX_URI_LEN=1024
# --- microlink (Tailscale client) requirements ---
# PSRAM allocator tuning (big coordination buffers go to PSRAM; keep small/ISR allocs internal)
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# TLS + cert bundle for the Tailscale control plane/DERP and OTA (GitHub Pages HTTPS).
# Full bundle (not just common) so any GitHub Pages / Fastly cert chain verifies for OTA.
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# --- OTA (over-the-air firmware update) ---
# Rollback: a freshly-OTA'd image boots in PENDING_VERIFY and must call
# esp_ota_mark_app_valid_cancel_rollback() once healthy; a boot-loop before that auto-reverts.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# mbedtls allocates from PSRAM, not internal DRAM: with LVGL+WiFi+Tailscale+audio up, the largest free
# internal block is ~5 KB — far too small for the ~20 KB TLS handshake buffers, which otherwise fails with
# MBEDTLS_ERR_SSL_ALLOC_FAILED (-0x7F00). PSRAM has ample contiguous space.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# Move WiFi/LWIP buffers to PSRAM too, freeing internal DRAM. The OTA download task's stack must be
# internal (it writes flash, which faults on a PSRAM-cached stack), and ~8 KB contiguous internal isn't
# otherwise available on this RAM-tight board.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# ChaCha20-Poly1305 for microlink's Noise/ts2021 control channel
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
# lwIP: IPv4 fragmentation/reassembly for WireGuard-tunnelled traffic
CONFIG_LWIP_IPV4=y
CONFIG_LWIP_IP4_FRAG=y
CONFIG_LWIP_IP4_REASSEMBLY=y
# microlink coordination + tasks need a roomier main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
